linklayer/BLEKey/nordic/nrf51822/Source/serialization/common/transport/ser_phy_hci.c
/* Copyright (c) 2014 Nordic Semiconductor. All Rights Reserved.
 *
 * The information contained herein is property of Nordic Semiconductor ASA.
 * Terms and conditions of usage are described in detail in NORDIC
 * SEMICONDUCTOR STANDARD SOFTWARE LICENSE AGREEMENT.
 *
 * Licensees are granted free, non-transferable use of the information. NO
 * WARRANTY of ANY KIND is provided. This heading must NOT be removed from
 * the file.
 *
 */

#include <stddef.h>
#include <string.h>

#include "app_error.h"
#include "app_util.h"
#include "app_util_platform.h"
#include "app_timer.h"
#include "app_mailbox.h"
#include "ser_phy.h"
#include "ser_phy_hci.h"
#include "crc16.h"
#include "nrf_soc.h"

#include "ser_config.h"
#include "ser_phy_debug_comm.h"

// hide globals for release version, expose for debug version
#if defined(SER_PHY_HCI_DEBUG_ENABLE)
#define _static
#else
#define _static static
#endif

#define PKT_HDR_SIZE            4 /**< Packet header size in number of bytes. */
#define PKT_CRC_SIZE            2 /**< Packet CRC size in number of bytes. */
#define MAX_PACKET_SIZE_IN_BITS (11uL * \
                                 (SER_HAL_TRANSPORT_MAX_PKT_SIZE + PKT_HDR_SIZE + PKT_CRC_SIZE))
#define BAUD_TIME_us            (1000000uL / SER_PHY_UART_BAUDRATE_VAL)

#define TX_EVT_QUEUE_SIZE            16
#define RX_EVT_QUEUE_SIZE            16
#define PKT_TYPE_VENDOR_SPECIFIC     14                                                /**< Packet type vendor specific. */
#define PKT_TYPE_ACK                 0                                                 /**< Packet type acknowledgement. */
#define DATA_INTEGRITY_MASK          (1 << 6)                                          /**< Mask for data integrity bit in the packet header. */
#define RELIABLE_PKT_MASK            (1 << 7)                                          /**< Mask for reliable packet bit in the packet header. */
#define INITIAL_ACK_NUMBER_EXPECTED  1                                                 /**< Initial acknowledge number expected. */
#define INITIAL_SEQ_NUMBER           INITIAL_ACK_NUMBER_EXPECTED                       /**< Initial acknowledge number transmitted. */
#define INVALID_PKT_TYPE             0xFFFFFFFFu                                       /**< Internal invalid packet type value. */
#define MAX_TRANSMISSION_TIME_ms     (MAX_PACKET_SIZE_IN_BITS * BAUD_TIME_us / 1000uL) /**< Max transmission time of a single application packet over UART in units of mseconds. */
#define RETRANSMISSION_TIMEOUT_IN_ms (10uL * MAX_TRANSMISSION_TIME_ms)                 /**< Retransmission timeout for application packet in units of mseconds. */

#ifndef APP_TIMER_PRESCALER
#define APP_TIMER_PRESCALER 0
#endif
#define RETRANSMISSION_TIMEOUT_IN_TICKS (APP_TIMER_TICKS(RETRANSMISSION_TIMEOUT_IN_ms, \
                                                         APP_TIMER_PRESCALER)) /**< Retransmission timeout for application packet in units of timer ticks. */
#define MAX_RETRY_COUNT                 5                                      /**< Max retransmission retry count for application packets. */

#if   (defined(HCI_TIMER0))
#define HCI_TIMER            NRF_TIMER0
#define HCI_TIMER_IRQn       TIMER0_IRQn
#define HCI_TIMER_IRQHandler TIMER0_IRQHandler
#elif (defined(HCI_TIMER1))
#define HCI_TIMER            NRF_TIMER1
#define HCI_TIMER_IRQn       TIMER1_IRQn
#define HCI_TIMER_IRQHandler TIMER1_IRQHandler
#elif (defined(HCI_TIMER2))
#define HCI_TIMER            NRF_TIMER2
#define HCI_TIMER_IRQn       TIMER2_IRQn
#define HCI_TIMER_IRQHandler TIMER2_IRQHandler
#else
#define HCI_APP_TIMER
#endif


/**@brief States of the hci event driven state machine. */
typedef enum
{
    HCI_TX_STATE_DISABLE,
    HCI_TX_STATE_SEND,
    HCI_TX_STATE_WAIT_FOR_FIRST_TX_END,
    HCI_TX_STATE_WAIT_FOR_ACK_OR_TX_END,
    HCI_TX_STATE_WAIT_FOR_ACK,
    HCI_TX_STATE_WAIT_FOR_TX_END
} hci_tx_fsm_state_t;

typedef enum
{
    HCI_RX_STATE_DISABLE,
    HCI_RX_STATE_RECEIVE,
    HCI_RX_STATE_WAIT_FOR_MEM,
    HCI_RX_STATE_WAIT_FOR_SLIP_ACK_END,
    HCI_RX_STATE_WAIT_FOR_SLIP_NACK_END,
} hci_rx_fsm_state_t;

typedef enum
{
    HCI_EVT_TIMEOUT,
} hci_timer_evt_type_t;

typedef enum
{
    HCI_SER_PHY_TX_REQUEST,
    HCI_SER_PHY_RX_BUF_GRANTED,
    HCI_SER_PHY_EVT_GEN_ENABLE,
    HCI_SER_PHY_EVT_GEN_DISABLE
} ser_phy_int_evt_type_t;

typedef enum
{
    HCI_SER_PHY_EVT,
    HCI_SLIP_EVT,
    HCI_TIMER_EVT,
} hci_evt_source_t;

typedef struct
{
    hci_timer_evt_type_t evt_type; /**< Type of an event. */
} hci_timer_evt_t;

typedef struct
{
    ser_phy_int_evt_type_t evt_type; /**< Type of an event. */
} ser_phy_int_evt_t;

typedef struct
{
    hci_evt_source_t evt_source; /**< source of an event. */
    union
    {
        ser_phy_int_evt_t      ser_phy_evt;      /**< ser_phy event. */
        ser_phy_hci_slip_evt_t ser_phy_slip_evt; /**< ser_phy_hci event. */
        hci_timer_evt_t        timer_evt;        /**< timer event. */
    } evt;
} hci_evt_t;

_static uint8_t m_tx_packet_header[PKT_HDR_SIZE];
_static uint8_t m_tx_packet_crc[PKT_CRC_SIZE];
_static uint8_t m_tx_ack_packet[PKT_HDR_SIZE];


_static uint32_t m_packet_ack_number; // Sequence number counter of the packet expected to be received
_static uint32_t m_packet_seq_number; // Sequence number counter of the transmitted packet for which acknowledgement packet is waited for


_static uint32_t m_tx_retry_count;


// _static uint32_t m_tx_retx_counter = 0;
// _static uint32_t m_rx_drop_counter = 0;


APP_MAILBOX_DEF(tx_evt_queue, TX_EVT_QUEUE_SIZE, hci_evt_t);
APP_MAILBOX_DEF(rx_evt_queue, RX_EVT_QUEUE_SIZE, hci_evt_t);

_static app_mailbox_id_t tx_evt_queue_id;
_static app_mailbox_id_t rx_evt_queue_id;

_static hci_tx_fsm_state_t m_hci_tx_fsm_state = HCI_TX_STATE_DISABLE;
_static hci_rx_fsm_state_t m_hci_rx_fsm_state = HCI_RX_STATE_DISABLE;

#ifdef HCI_APP_TIMER
_static app_timer_id_t m_app_timer_id;
#endif

_static bool m_tx_fsm_idle_flag = true;
_static bool m_rx_fsm_idle_flag = true;

_static bool m_buffer_reqested_flag = false;

_static uint8_t * m_p_rx_buffer = NULL;
_static uint16_t  m_rx_packet_length;
_static uint8_t * m_p_rx_packet;
_static uint8_t * m_p_tx_payload = NULL;
_static uint16_t  m_tx_payload_length;

_static ser_phy_events_handler_t m_ser_phy_callback = NULL;

