linklayer/BLEKey/nordic/nrf51822/Source/serialization/common/transport/ser_phy_hci.c
static void hci_tx_event_handler(hci_evt_t * p_event);
static void hci_rx_event_handler(hci_evt_t * p_event);

_static bool m_hci_timer_enabled_flag  = true;
_static bool m_hci_timout_pending_flag = false;
_static bool m_hci_global_enable_flag  = true;

#define ser_phy_hci_assert(cond) APP_ERROR_CHECK_BOOL(cond)

static void hci_signal_timeout_event(void)
{
    hci_evt_t event;

    event.evt_source             = HCI_TIMER_EVT;
    event.evt.timer_evt.evt_type = HCI_EVT_TIMEOUT;
    DEBUG_EVT_TIMEOUT(0);
    hci_tx_event_handler(&event);
}


#ifndef HCI_APP_TIMER

void HCI_TIMER_IRQHandler(void)
{

    if ((HCI_TIMER->EVENTS_COMPARE[1] == 1) && (HCI_TIMER->INTENSET & TIMER_INTENSET_COMPARE1_Msk))
    {
        HCI_TIMER->EVENTS_COMPARE[1] = 0;
        HCI_TIMER->TASKS_CLEAR       = 1;

        if (m_hci_timer_enabled_flag)
        {
            hci_signal_timeout_event();
        }
        else
        {
            m_hci_timout_pending_flag = true;
        }
    }
}


static void hci_timeout_setup(uint32_t count)
{

    uint32_t time_msec;

    if (count)
    {
        HCI_TIMER->INTENCLR          = TIMER_INTENCLR_COMPARE1_Msk;
        time_msec                    = count * RETRANSMISSION_TIMEOUT_IN_ms;
        HCI_TIMER->CC[1]             = time_msec * 31;
        HCI_TIMER->CC[1]            += time_msec / 4;
        HCI_TIMER->TASKS_CLEAR       = 1; // < Clear TIMER
        HCI_TIMER->EVENTS_COMPARE[1] = 0;
        HCI_TIMER->TASKS_START       = 1; // < Start TIMER
        HCI_TIMER->INTENSET          = TIMER_INTENSET_COMPARE1_Msk;
    }
    else
    {
        HCI_TIMER->INTENCLR   = TIMER_INTENCLR_COMPARE1_Msk;
        HCI_TIMER->TASKS_STOP = 1; // < Start TIMER
    }
}


#else

_static bool     m_hci_timer_setup_flag = false;
_static uint32_t m_hci_timer_counter    = 0;
_static uint32_t m_hci_timer_setup;

static void hci_timeout_setup(uint32_t count)
{
    m_hci_timer_setup      = count;
    m_hci_timer_setup_flag = true;
}


static void hci_timeout_handler(void * p_context)
{

    if (m_hci_timer_setup_flag)
    {
        m_hci_timer_setup_flag = false;
        m_hci_timer_counter    = m_hci_timer_setup; /* for 1 it will be always more than 1 tick - jitter is up to 1 tick */
    }
    else if ( m_hci_timer_counter )
    {
        m_hci_timer_counter--;

        if (m_hci_timer_counter == 0)
        {
            if (m_hci_timer_enabled_flag)
            {
                hci_signal_timeout_event();
            }
            else
            {
                m_hci_timout_pending_flag = true;
            }
        }
    }
    return;
}


#endif


/**@brief Function for validating a received packet.
 *
 * @param[in] p_buffer Pointer to the packet data.
 * @param[in] length   Length of packet data in bytes.
 *
 * @return true if received packet is valid, false in other case.
 */
static bool is_rx_pkt_valid(const uint8_t * p_buffer, uint32_t length)
{
    // Executed packet filtering algorithm order:
    // - verify packet overall length
    // - verify data integrity bit set
    // - verify reliable packet bit set
    // - verify supported packet type
    // - verify header checksum
    // - verify payload length field
    // - verify CRC
    if (length <= PKT_HDR_SIZE)
    {
        return false;
    }

    if (!(p_buffer[0] & DATA_INTEGRITY_MASK))
    {
        return false;
    }

    if (!(p_buffer[0] & RELIABLE_PKT_MASK))
    {
        return false;
    }

    if ((p_buffer[1] & 0x0Fu) != PKT_TYPE_VENDOR_SPECIFIC)
    {
        return false;
    }

    const uint32_t expected_checksum =
        ((p_buffer[0] + p_buffer[1] + p_buffer[2] + p_buffer[3])) & 0xFFu;

    if (expected_checksum != 0)
    {
        return false;
    }

    const uint16_t crc_calculated = crc16_compute(p_buffer, (length - PKT_CRC_SIZE), NULL);
    const uint16_t crc_received   = uint16_decode(&p_buffer[length - PKT_CRC_SIZE]);

    if (crc_calculated != crc_received)
    {
        return false;
    }

    return true;
}


/**@brief Function for getting the sequence number of the next reliable packet expected.
 *
 * @return sequence number of the next reliable packet expected.
 */
static __INLINE uint8_t packet_ack_get(void)
{
    return (uint8_t) m_packet_ack_number;
}


/**@brief Function for getting the sequence number of a reliable TX packet for which peer protocol
 * entity acknowledgment is pending.
 *
 * @return sequence number of a reliable TX packet for which peer protocol entity acknowledgement
 * is pending.
 */
static __INLINE uint8_t packet_seq_get(void)
{
    return m_packet_seq_number;
}


static __INLINE uint8_t packet_seq_nmbr_extract(const uint8_t * p_buffer)
{
    return (p_buffer[0] & 0x07u);
}


/**@brief Function for constructing 1st byte of the packet header of the packet to be transmitted.
 *
 * @return 1st byte of the packet header of the packet to be transmitted
 */
static __INLINE uint8_t tx_packet_byte_zero_construct(void)
{
    const uint32_t value = DATA_INTEGRITY_MASK | RELIABLE_PKT_MASK |
                           (packet_ack_get() << 3u) | packet_seq_get();

    return (uint8_t) value;
}


/**@brief Function for calculating a packet header checksum.
 *
 * @param[in] p_hdr Pointer to the packet header.
 *
 * @return          Calculated checksum.
 */
static __INLINE uint8_t header_checksum_calculate(const uint8_t * p_hdr)
{
    // @note: no pointer validation check needed as already checked by calling function.
    uint32_t checksum;

    checksum  = p_hdr[0];
    checksum += p_hdr[1];
    checksum += p_hdr[2];
    checksum &= 0xFFu;
    checksum  = (~checksum + 1u);

    return (uint8_t)checksum;
}


/**@brief Function for getting the expected ACK number.
 *
 * @return expected ACK number.
 */
static __INLINE uint8_t expected_ack_number_get(void)
{
    uint8_t seq_nmbr = packet_seq_get();

    ++seq_nmbr;
    seq_nmbr &= 0x07u;

    return seq_nmbr;
}


/**@brief Function for getting the expected ACK number.
 *
 * @return next expected ACK number.
 */

