linklayer/BLEKey/nordic/nrf51822/Source/serialization/common/transport/ser_phy_hci.c
static __INLINE uint8_t next_expected_ack_number_get(void)
{
    uint8_t seq_nmbr = expected_ack_number_get();

    ++seq_nmbr;
    seq_nmbr &= 0x07u;

    return seq_nmbr;
}


/**@brief Function for processing a received acknowledgement packet.
 *
 * Verifies does the received acknowledgement packet has the expected acknowledgement number and
 * that the header checksum is correct.
 *
 * @param[in] p_buffer Pointer to the packet data.
 *
 * @return true if valid acknowledgement packet received.
 */

static bool rx_ack_pkt_valid(const uint8_t * p_buffer)
{
    // @note: no pointer validation check needed as allready checked by calling function.

    // Verify header checksum.
    const uint32_t expected_checksum =
        ((p_buffer[0] + p_buffer[1] + p_buffer[2] + p_buffer[3])) & 0xFFu;

    if (expected_checksum != 0)
    {
        return false;
    }

    const uint8_t ack_number = (p_buffer[0] >> 3u) & 0x07u;

    // Verify expected acknowledgment number.
    return ( (ack_number == expected_ack_number_get()) ||
             (ack_number == next_expected_ack_number_get()) );
}


/**@brief Function for decoding a packet type field.
 *
 * @param[in] p_buffer Pointer to the packet data.
 * @param[in] length   Length of packet data in bytes.
 *
 * @return Packet type field or INVALID_PKT_TYPE in case of decode error.
 */

static uint32_t packet_type_decode(const uint8_t * p_buffer, uint32_t length)
{
    // @note: no pointer validation check needed as allready checked by calling function.
    uint32_t return_value;

    if (length >= PKT_HDR_SIZE)
    {
        return_value = (p_buffer[1] & 0x0Fu);
    }
    else
    {
        return_value = INVALID_PKT_TYPE;
    }

    return return_value;
}


/**@brief Function for writing an acknowledgment packet for transmission.
 */

static void ack_transmit(void)
{
    uint32_t err_code;

    // TX ACK packet format:
    // - Unreliable Packet type
    // - Payload Length set to 0
    // - Sequence Number set to 0
    // - Header checksum calculated
    // - Acknowledge Number set correctly
    m_tx_ack_packet[0] = (packet_ack_get() << 3u);
    m_tx_ack_packet[1] = 0;
    m_tx_ack_packet[2] = 0;
    m_tx_ack_packet[3] = header_checksum_calculate(m_tx_ack_packet);

    ser_phy_hci_pkt_params_t pkt_header;

    pkt_header.p_buffer     = m_tx_ack_packet;
    pkt_header.num_of_bytes = PKT_HDR_SIZE;
    DEBUG_EVT_SLIP_ACK_TX(0);
    err_code = ser_phy_hci_slip_tx_pkt_send(&pkt_header, NULL, NULL);
    ser_phy_hci_assert(err_code == NRF_SUCCESS);

    return;
}


static void ser_phy_event_callback(ser_phy_evt_t event)
{
    if (m_ser_phy_callback)
    {
        m_ser_phy_callback(event);
    }

    return;
}


static void memory_request_callback(uint16_t size)
{
    ser_phy_evt_t event;

    DEBUG_EVT_HCI_PHY_EVT_BUF_REQUEST(0);

    event.evt_type                               = SER_PHY_EVT_RX_BUF_REQUEST;
    event.evt_params.rx_buf_request.num_of_bytes = size;
    ser_phy_event_callback(event);
}


static void packet_received_callback(uint8_t * pBuffer, uint16_t size)
{
    ser_phy_evt_t event;

    DEBUG_EVT_HCI_PHY_EVT_RX_PKT_RECEIVED(0);

    event.evt_type = SER_PHY_EVT_RX_PKT_RECEIVED;
    event.evt_params.rx_pkt_received.num_of_bytes = size;
    event.evt_params.rx_pkt_received.p_buffer     = pBuffer;
    ser_phy_event_callback(event);
}


static void packet_dropped_callback(void)
{
    ser_phy_evt_t event;

    DEBUG_EVT_HCI_PHY_EVT_RX_PKT_DROPPED(0);

    event.evt_type = SER_PHY_EVT_RX_PKT_DROPPED;
    ser_phy_event_callback(event);
}


static void packet_transmitted_callback(void)
{
    ser_phy_evt_t event;

    DEBUG_EVT_HCI_PHY_EVT_TX_PKT_SENT(0);

    event.evt_type = SER_PHY_EVT_TX_PKT_SENT;
    ser_phy_event_callback(event);
}


static void error_callback(void)
{
    ser_phy_evt_t event;

    DEBUG_EVT_HCI_PHY_EVT_TX_ERROR(0);

    event.evt_type = SER_PHY_EVT_HW_ERROR;
    ser_phy_event_callback(event);
}


static void hci_slip_event_handler(ser_phy_hci_slip_evt_t * p_event)
{
    hci_evt_t event;
    uint32_t  packet_type;
    uint32_t  err_code;

    if ( p_event->evt_type == SER_PHY_HCI_SLIP_EVT_PKT_SENT )
    {
        DEBUG_EVT_SLIP_PACKET_TXED(0);
        event.evt_source                    = HCI_SLIP_EVT;
        event.evt.ser_phy_slip_evt.evt_type = p_event->evt_type;
        hci_tx_event_handler(&event);
    }
    else if ( p_event->evt_type == SER_PHY_HCI_SLIP_EVT_ACK_SENT )
    {
        DEBUG_EVT_SLIP_ACK_TXED(0);
        event.evt_source                    = HCI_SLIP_EVT;
        event.evt.ser_phy_slip_evt.evt_type = p_event->evt_type;
        hci_rx_event_handler(&event);
    }

    else if ( p_event->evt_type == SER_PHY_HCI_SLIP_EVT_PKT_RECEIVED )
    {
        event.evt_source = HCI_SLIP_EVT;
        event.evt.ser_phy_slip_evt.evt_type                         = p_event->evt_type;
        event.evt.ser_phy_slip_evt.evt_params.received_pkt.p_buffer =
            p_event->evt_params.received_pkt.p_buffer;
        event.evt.ser_phy_slip_evt.evt_params.received_pkt.num_of_bytes =
            p_event->evt_params.received_pkt.num_of_bytes;
        ser_phy_hci_assert(event.evt.ser_phy_slip_evt.evt_params.received_pkt.p_buffer != NULL);
        ser_phy_hci_assert(event.evt.ser_phy_slip_evt.evt_params.received_pkt.num_of_bytes != 0);
        packet_type = packet_type_decode(
            event.evt.ser_phy_slip_evt.evt_params.received_pkt.p_buffer,
            event.evt.ser_phy_slip_evt.evt_params.received_pkt.num_of_bytes);

        if (packet_type == PKT_TYPE_ACK )
        {
            DEBUG_EVT_SLIP_ACK_RXED(0);
            hci_tx_event_handler(&event);
        }
        else if ( packet_type == PKT_TYPE_VENDOR_SPECIFIC )
        {
            if (is_rx_pkt_valid(event.evt.ser_phy_slip_evt.evt_params.received_pkt.p_buffer,
                                event.evt.ser_phy_slip_evt.evt_params.received_pkt.num_of_bytes))
            {
                DEBUG_EVT_SLIP_PACKET_RXED(0);
                hci_rx_event_handler(&event);
            }
            else
            {
                err_code = ser_phy_hci_slip_rx_buf_free(
                    event.evt.ser_phy_slip_evt.evt_params.received_pkt.p_buffer);
                ser_phy_hci_assert(err_code == NRF_SUCCESS);
                /* throw assert when in debug mode*/
                DEBUG_EVT_SLIP_ERR_RXED(0);
            }
        }
        else
        {
            err_code = ser_phy_hci_slip_rx_buf_free(
                event.evt.ser_phy_slip_evt.evt_params.received_pkt.p_buffer);
            ser_phy_hci_assert(err_code == NRF_SUCCESS);
            /* throw assert when in debug mode*/
            DEBUG_EVT_SLIP_ERR_RXED(0);
        }
    }

