linklayer/BLEKey/nordic/nrf51822/Source/serialization/common/transport/ser_phy_hci.c
}


static void hci_pkt_send(void)
{
    uint32_t err_code;

    m_tx_packet_header[0] = tx_packet_byte_zero_construct();
    uint16_t type_and_length_fields = ((m_tx_payload_length << 4u) | PKT_TYPE_VENDOR_SPECIFIC);
    (void)uint16_encode(type_and_length_fields, &(m_tx_packet_header[1]));
    m_tx_packet_header[3] = header_checksum_calculate(m_tx_packet_header);
    uint16_t crc = crc16_compute(m_tx_packet_header, PKT_HDR_SIZE, NULL);
    crc = crc16_compute(m_p_tx_payload, m_tx_payload_length, &crc);
    (void)uint16_encode(crc, m_tx_packet_crc);

    ser_phy_hci_pkt_params_t pkt_header;
    ser_phy_hci_pkt_params_t pkt_payload;
    ser_phy_hci_pkt_params_t pkt_crc;

    pkt_header.p_buffer      = m_tx_packet_header;
    pkt_header.num_of_bytes  = PKT_HDR_SIZE;
    pkt_payload.p_buffer     = m_p_tx_payload;
    pkt_payload.num_of_bytes = m_tx_payload_length;
    pkt_crc.p_buffer         = m_tx_packet_crc;
    pkt_crc.num_of_bytes     = PKT_CRC_SIZE;
    DEBUG_EVT_SLIP_PACKET_TX(0);
    err_code = ser_phy_hci_slip_tx_pkt_send(&pkt_header, &pkt_payload, &pkt_crc);
    ser_phy_hci_assert(err_code == NRF_SUCCESS);

    return;
}


static void hci_pkt_sent_upcall(void)
{
    m_packet_seq_number++; // incoming ACK is valid, increment SEQ
    m_packet_seq_number &= 0x07u;
    m_p_tx_payload       = NULL;
    packet_transmitted_callback();

    return;
}


static void hci_release_ack_buffer(hci_evt_t * p_event)
{
    uint32_t err_code;

    err_code = ser_phy_hci_slip_rx_buf_free(
        p_event->evt.ser_phy_slip_evt.evt_params.received_pkt.p_buffer);
    ser_phy_hci_assert(err_code == NRF_SUCCESS);

    return;
}


static void hci_process_orphaned_ack(hci_evt_t * p_event)
{
    hci_release_ack_buffer(p_event);
    return;
}


/* main tx fsm   */
static void hci_tx_fsm_event_process(hci_evt_t * p_event)
{

    switch (m_hci_tx_fsm_state)
    {
        case HCI_TX_STATE_SEND:

            if ((p_event->evt_source == HCI_SER_PHY_EVT) &&
                (p_event->evt.ser_phy_evt.evt_type == HCI_SER_PHY_TX_REQUEST))
            {
                hci_pkt_send();
                hci_timeout_setup(0);
                m_tx_retry_count   = MAX_RETRY_COUNT;
                m_hci_tx_fsm_state = HCI_TX_STATE_WAIT_FOR_FIRST_TX_END;
            }
            else if ((p_event->evt_source == HCI_SLIP_EVT) &&
                     (p_event->evt.ser_phy_slip_evt.evt_type == SER_PHY_HCI_SLIP_EVT_PKT_RECEIVED))
            {
                hci_process_orphaned_ack(p_event);
            }

            break;

        case HCI_TX_STATE_WAIT_FOR_FIRST_TX_END:

            if ((p_event->evt_source == HCI_SLIP_EVT) &&
                (p_event->evt.ser_phy_slip_evt.evt_type == SER_PHY_HCI_SLIP_EVT_PKT_SENT))
            {
                hci_timeout_setup(1);
                m_hci_tx_fsm_state = HCI_TX_STATE_WAIT_FOR_ACK;
            }
            else if ((p_event->evt_source == HCI_SLIP_EVT) &&
                     (p_event->evt.ser_phy_slip_evt.evt_type == SER_PHY_HCI_SLIP_EVT_PKT_RECEIVED))
            {
                hci_process_orphaned_ack(p_event);
            }
            break;

        case HCI_TX_STATE_WAIT_FOR_ACK_OR_TX_END:

            if ((p_event->evt_source == HCI_SLIP_EVT) &&
                (p_event->evt.ser_phy_slip_evt.evt_type == SER_PHY_HCI_SLIP_EVT_PKT_SENT))
            {
                hci_timeout_setup(1);
                m_hci_tx_fsm_state = HCI_TX_STATE_WAIT_FOR_ACK;
            }
            else if ((p_event->evt_source == HCI_SLIP_EVT) &&
                     (p_event->evt.ser_phy_slip_evt.evt_type == SER_PHY_HCI_SLIP_EVT_PKT_RECEIVED))
            {
                if (rx_ack_pkt_valid(p_event->evt.ser_phy_slip_evt.evt_params.received_pkt.p_buffer))
                {
                    hci_timeout_setup(0);
                    m_hci_tx_fsm_state = HCI_TX_STATE_WAIT_FOR_TX_END;
                }
                hci_release_ack_buffer(p_event);
            }
            break;

        case HCI_TX_STATE_WAIT_FOR_ACK:

            if ((p_event->evt_source == HCI_SLIP_EVT) &&
                (p_event->evt.ser_phy_slip_evt.evt_type == SER_PHY_HCI_SLIP_EVT_PKT_RECEIVED))
            {
                if (rx_ack_pkt_valid(p_event->evt.ser_phy_slip_evt.evt_params.received_pkt.p_buffer))
                {
                    hci_timeout_setup(0);
                    hci_pkt_sent_upcall();
                    m_hci_tx_fsm_state = HCI_TX_STATE_SEND;
                }
                hci_release_ack_buffer(p_event);
            }
            else if (p_event->evt_source == HCI_TIMER_EVT)
            {
                m_tx_retry_count--;

                // m_tx_retx_counter++; // global retransmissions counter
                if (m_tx_retry_count)
                {
                    hci_pkt_send();
                    DEBUG_HCI_RETX(0);
                    m_hci_tx_fsm_state = HCI_TX_STATE_WAIT_FOR_ACK_OR_TX_END;
                }
                else
                {
                    error_callback();
                    m_hci_tx_fsm_state = HCI_TX_STATE_SEND;
                }
            }
            break;

        case HCI_TX_STATE_WAIT_FOR_TX_END:

            if ((p_event->evt_source == HCI_SLIP_EVT) &&
                (p_event->evt.ser_phy_slip_evt.evt_type == SER_PHY_HCI_SLIP_EVT_PKT_SENT))
            {
                hci_pkt_sent_upcall();
                m_hci_tx_fsm_state = HCI_TX_STATE_SEND;
            }
            else if ((p_event->evt_source == HCI_SLIP_EVT) &&
                     (p_event->evt.ser_phy_slip_evt.evt_type == SER_PHY_HCI_SLIP_EVT_PKT_RECEIVED))
            {
                hci_process_orphaned_ack(p_event);
            }

            break;

        default:
            ser_phy_hci_assert(false);
            break;
    }
}


static void hci_mem_request(hci_evt_t * p_event)
{
    m_buffer_reqested_flag = true;
    m_p_rx_packet          = p_event->evt.ser_phy_slip_evt.evt_params.received_pkt.p_buffer;
    m_rx_packet_length     = p_event->evt.ser_phy_slip_evt.evt_params.received_pkt.num_of_bytes;
    ser_phy_hci_assert(m_rx_packet_length > PKT_HDR_SIZE + PKT_CRC_SIZE);
    memory_request_callback(m_rx_packet_length - PKT_HDR_SIZE - PKT_CRC_SIZE);
    return;
}


static void hci_inc_ack()
{
    m_packet_ack_number++;
    m_packet_ack_number &= 0x07u;
}


static void hci_rx_fsm_event_process(hci_evt_t * p_event)
{
    switch (m_hci_rx_fsm_state)
    {
        case HCI_RX_STATE_RECEIVE:

