linklayer/BLEKey/nordic/nrf51822/Source/serialization/common/transport/ser_phy_hci.c
            if ((p_event->evt_source == HCI_SLIP_EVT) &&
                (p_event->evt.ser_phy_slip_evt.evt_type == SER_PHY_HCI_SLIP_EVT_PKT_RECEIVED))
            {
                /* type and crc and check sum are validated by slip handler */
                uint8_t rx_seq_number = packet_seq_nmbr_extract(
                    p_event->evt.ser_phy_slip_evt.evt_params.received_pkt.p_buffer);

                if (packet_ack_get() == rx_seq_number)
                {
                    hci_mem_request(p_event);
                    m_hci_rx_fsm_state = HCI_RX_STATE_WAIT_FOR_MEM;
                }
                else
                {
                    // m_rx_drop_counter++;
                    m_hci_rx_fsm_state = HCI_RX_STATE_WAIT_FOR_SLIP_NACK_END;
                    (void) ser_phy_hci_slip_rx_buf_free(m_p_rx_packet); // and drop a packet
                    ack_transmit();                                     // send NACK with valid ACK
                }
            }
            break;

        case HCI_RX_STATE_WAIT_FOR_MEM:

            if ((p_event->evt_source == HCI_SER_PHY_EVT) &&
                (p_event->evt.ser_phy_evt.evt_type == HCI_SER_PHY_RX_BUF_GRANTED))
            {
                if (m_p_rx_buffer)
                {
                    memcpy(m_p_rx_buffer,
                           m_p_rx_packet + PKT_HDR_SIZE,
                           m_rx_packet_length - PKT_HDR_SIZE - PKT_CRC_SIZE);
                    (void) ser_phy_hci_slip_rx_buf_free(m_p_rx_packet);
                }
                m_hci_rx_fsm_state = HCI_RX_STATE_WAIT_FOR_SLIP_ACK_END;
                hci_inc_ack(); // SEQ was valid for good packet, we will send incremented SEQ as ACK
                ack_transmit();
            }

            break;

        case HCI_RX_STATE_WAIT_FOR_SLIP_ACK_END:

            if ((p_event->evt_source == HCI_SLIP_EVT) &&
                (p_event->evt.ser_phy_slip_evt.evt_type == SER_PHY_HCI_SLIP_EVT_ACK_SENT))
            {

                if (m_p_rx_buffer)
                {
                    packet_received_callback(m_p_rx_buffer,
                                             m_rx_packet_length - PKT_HDR_SIZE - PKT_CRC_SIZE);
                }
                else
                {
                    packet_dropped_callback();
                }
                m_hci_rx_fsm_state = HCI_RX_STATE_RECEIVE;
            }
            break;

        case HCI_RX_STATE_WAIT_FOR_SLIP_NACK_END:
            m_hci_rx_fsm_state = HCI_RX_STATE_RECEIVE;
            break;

        default:
            ser_phy_hci_assert(false);
            break;
    }
}


/* this function might be entered only via hci_tx_event_handler */
static void hci_tx_fsm(void)
{
    hci_evt_t event;
    uint32_t  err_code = NRF_SUCCESS;

    while (err_code == NRF_SUCCESS)
    {

        CRITICAL_REGION_ENTER();
        err_code = app_mailbox_get(tx_evt_queue_id, &event);

        if (err_code != NRF_SUCCESS)
        {
            m_tx_fsm_idle_flag = true;
        }
        CRITICAL_REGION_EXIT();

        if (err_code == NRF_SUCCESS)
        {
            hci_tx_fsm_event_process(&event); /* this is the only entry to the TX_FSM */
        }
    }
    return;
}


/* this function might be entered only via hci_rx_event_handler */
static void hci_rx_fsm(void)
{
    hci_evt_t event;
    uint32_t  err_code = NRF_SUCCESS;

    while (err_code == NRF_SUCCESS)
    {
        CRITICAL_REGION_ENTER();
        err_code = app_mailbox_get(rx_evt_queue_id, &event);

        if (err_code != NRF_SUCCESS)
        {
            m_rx_fsm_idle_flag = true;
        }
        CRITICAL_REGION_EXIT();

        if (err_code == NRF_SUCCESS)
        {
            hci_rx_fsm_event_process(&event); /* this is the only entry to the RX_FSM */
        }
    }
    return;
}


/* something might have been queued by API with disabled 'PHY-interrupts' */
static void hci_tx_reschedule()
{
    bool     tx_exec_flag = false;
    uint32_t tx_queue_length;
    uint32_t err_code;

    CRITICAL_REGION_ENTER();
    err_code = app_mailbox_get_length(tx_evt_queue_id, &tx_queue_length);
    ser_phy_hci_assert(err_code == NRF_SUCCESS);

    if (m_tx_fsm_idle_flag && m_hci_global_enable_flag && tx_queue_length)
    {
        tx_exec_flag       = true;  // FSM should be activated
        m_tx_fsm_idle_flag = false; // FSM will be busy from now on till the queue is exhausted
    }
    CRITICAL_REGION_EXIT();

    if (tx_exec_flag)
    {
        hci_tx_fsm();
    }
    return;
}


/* entry to TX state machine, might be called asynchronously from different contexts */
/* Puts event into the TX event queue and execute if FSM was idle */
static void hci_tx_event_handler(hci_evt_t * p_event)
{
    bool     tx_exec_flag = false;
    uint32_t err_code;

    CRITICAL_REGION_ENTER();
    err_code = app_mailbox_put(tx_evt_queue_id, p_event);
    ser_phy_hci_assert(err_code == NRF_SUCCESS);

    // CRITICAL_REGION_ENTER();
    /* only one process can acquire tx_exec_flag */
    if (m_tx_fsm_idle_flag && m_hci_global_enable_flag)
    {
        tx_exec_flag       = true;  // FSM should be activated
        m_tx_fsm_idle_flag = false; // FSM will be busy from now on till the queue is exhausted
    }
    CRITICAL_REGION_EXIT();

    if (tx_exec_flag)
    {
        hci_tx_fsm();
    }
    return;
}


/* Something might have been queued by API with disabled 'PHY-interrupts' */
static void hci_rx_reschedule()
{
    bool     rx_exec_flag = false;
    uint32_t rx_queue_length;
    uint32_t err_code;

    CRITICAL_REGION_ENTER();
    err_code = app_mailbox_get_length(rx_evt_queue_id, &rx_queue_length);
    ser_phy_hci_assert(err_code == NRF_SUCCESS);

    if (m_rx_fsm_idle_flag && m_hci_global_enable_flag && rx_queue_length)
    {
        rx_exec_flag       = true;  // FSM should be activated
        m_rx_fsm_idle_flag = false; // FSM will be busy from now on till the queue is exhausted
    }
    CRITICAL_REGION_EXIT();

    if (rx_exec_flag)
    {
        hci_rx_fsm();
    }

