linklayer/BLEKey/nordic/nrf51822/Source/serialization/common/transport/ser_phy_hci.c
}


/* Entry to RX state machine, might be called asynchronously from different contexts */
/* Puts event into the RX event queue and execute if FSM was idle */
static void hci_rx_event_handler(hci_evt_t * p_event)
{
    bool     rx_exec_flag = false;
    uint32_t err_code;

    CRITICAL_REGION_ENTER();
    err_code = app_mailbox_put(rx_evt_queue_id, p_event);
    ser_phy_hci_assert(err_code == NRF_SUCCESS);

    /* only one process can acquire rx_exec_flag */
    // CRITICAL_REGION_ENTER();
    if (m_rx_fsm_idle_flag && m_hci_global_enable_flag)
    {
        rx_exec_flag       = true;  // FSM should be activated
        m_rx_fsm_idle_flag = false; // FSM will be busy from now on till the queue is exhausted
    }
    CRITICAL_REGION_EXIT();

    if (rx_exec_flag)
    {
        hci_rx_fsm();
    }

    return;
}


/* ser_phy API function */
void ser_phy_interrupts_enable(void)
{
    bool pending_timer_callback_flag = false;

    CRITICAL_REGION_ENTER();
    m_hci_timer_enabled_flag = true;

    if (m_hci_timout_pending_flag)
    {
        m_hci_timout_pending_flag   = false;
        pending_timer_callback_flag = true;
    }
    CRITICAL_REGION_EXIT();
    // this is a workaround - scheduled SER_PHY EVENTS
    m_hci_global_enable_flag = true;
    hci_tx_reschedule();
    hci_rx_reschedule();

    if (pending_timer_callback_flag)
    {
        hci_signal_timeout_event();
    }
    ser_phy_hci_slip_interrupts_enable();

    return;
}


/* ser_phy API function */
void ser_phy_interrupts_disable(void)
{
    ser_phy_hci_slip_interrupts_disable();
    CRITICAL_REGION_ENTER();
    m_hci_timer_enabled_flag = false;
    // transport calls PHY API with ser_phy_interrupts_disabled
    m_hci_global_enable_flag = false;
    CRITICAL_REGION_EXIT();
}


/* ser_phy API function */
uint32_t ser_phy_rx_buf_set(uint8_t * p_buffer)
{
    uint32_t  status = NRF_SUCCESS;
    hci_evt_t event;

    if (m_buffer_reqested_flag)
    {
        m_buffer_reqested_flag         = false;
        m_p_rx_buffer                  = p_buffer;
        event.evt_source               = HCI_SER_PHY_EVT;
        event.evt.ser_phy_evt.evt_type = HCI_SER_PHY_RX_BUF_GRANTED;
        hci_rx_event_handler(&event);
    }
    else
    {
        status = NRF_ERROR_BUSY;
    }
    return status;
}


/* ser_phy API function */
uint32_t ser_phy_tx_pkt_send(const uint8_t * p_buffer, uint16_t num_of_bytes)
{
    uint32_t  status = NRF_SUCCESS;
    hci_evt_t event;

    if ( p_buffer == NULL || num_of_bytes == 0)
    {
        return NRF_ERROR_NULL;
    }

    if ( m_p_tx_payload == NULL)
    {
        m_tx_payload_length = num_of_bytes;
        m_p_tx_payload      = (uint8_t *)p_buffer;
        DEBUG_EVT_TX_REQ(0);
        event.evt_source               = HCI_SER_PHY_EVT;
        event.evt.ser_phy_evt.evt_type = HCI_SER_PHY_TX_REQUEST;
        hci_tx_event_handler(&event);
    }
    else
    {
        status = NRF_ERROR_BUSY;
    }

    return status;
}


static uint32_t  hci_timer_init(void)
{
    uint32_t err_code = NRF_SUCCESS;

#ifdef HCI_APP_TIMER

    err_code = app_timer_create(&m_app_timer_id, APP_TIMER_MODE_REPEATED, hci_timeout_handler);

    if (err_code != NRF_SUCCESS)
    {
        return NRF_ERROR_INTERNAL;
    }

    err_code = app_timer_start(m_app_timer_id, RETRANSMISSION_TIMEOUT_IN_TICKS, NULL);

    if (err_code != NRF_SUCCESS)
    {
        return NRF_ERROR_INTERNAL;
    }

#else

    // Configure TIMER for compare[1] event
    HCI_TIMER->PRESCALER = 9;
    HCI_TIMER->MODE      = TIMER_MODE_MODE_Timer;
    HCI_TIMER->BITMODE   = TIMER_BITMODE_BITMODE_32Bit;

    // Clear TIMER
    HCI_TIMER->TASKS_CLEAR = 1;

    // Enable interrupt
    HCI_TIMER->INTENCLR = 0xFFFFFFFF;
    HCI_TIMER->INTENSET = TIMER_INTENSET_COMPARE1_Enabled << TIMER_INTENSET_COMPARE1_Pos;

    NVIC_ClearPendingIRQ(HCI_TIMER_IRQn);
    NVIC_SetPriority(HCI_TIMER_IRQn, APP_IRQ_PRIORITY_HIGH);
    NVIC_EnableIRQ(HCI_TIMER_IRQn);

#endif

    return err_code;

}


/* ser_phy API function */
uint32_t ser_phy_open(ser_phy_events_handler_t events_handler)
{
    uint32_t err_code;

    if ((m_hci_tx_fsm_state != HCI_TX_STATE_DISABLE) || (m_hci_rx_fsm_state != HCI_RX_STATE_DISABLE))
    {
        return NRF_ERROR_INVALID_STATE;
    }

    if (events_handler == NULL)
    {
        return NRF_ERROR_NULL;
    }

    err_code = hci_timer_init();

    if (err_code != NRF_SUCCESS)
    {
        return NRF_ERROR_INTERNAL;
    }

    err_code = app_mailbox_create(APP_MAILBOX(tx_evt_queue), &tx_evt_queue_id);

    if (err_code != NRF_SUCCESS)
    {
        return NRF_ERROR_INTERNAL;
    }

    err_code = app_mailbox_create(APP_MAILBOX(rx_evt_queue), &rx_evt_queue_id);

    if (err_code != NRF_SUCCESS)
    {
        return NRF_ERROR_INTERNAL;
    }

    err_code = ser_phy_hci_slip_open(hci_slip_event_handler);

    if (err_code != NRF_SUCCESS)
    {
        return err_code;
    }

    if (err_code == NRF_SUCCESS)
    {
        m_packet_ack_number = INITIAL_ACK_NUMBER_EXPECTED;
        m_packet_seq_number = INITIAL_SEQ_NUMBER;
        m_hci_tx_fsm_state  = HCI_TX_STATE_SEND;
        m_hci_rx_fsm_state  = HCI_RX_STATE_RECEIVE;
        m_ser_phy_callback  = events_handler;
    }
    return err_code;
}


/* ser_phy API function */
void ser_phy_close(void)
{
    m_ser_phy_callback = NULL;
    ser_phy_hci_slip_close();
    m_hci_tx_fsm_state = HCI_TX_STATE_DISABLE;
    m_hci_rx_fsm_state = HCI_RX_STATE_DISABLE;
}


